package For;
import java.util.*;

class B1_for {
    public static void main(String[] args) {
        try (Scanner scanner = new Scanner(System.in)) {  // โปรแกรมจะสร้างอินสแตนซ์ของคลาส Scanner เพื่อรับข้อมูลจากผู้ใช้ผ่านคีย์บอร์ด
            System.out.print("ตัวเลขเริ่มต้น: ");  // โปรแกรมจะแสดงข้อความ "ตัวเลขเริ่มต้น: " เพื่อให้ผู้ใช้ป้อนค่าตัวเลขเริ่มต้น
            int numStart = scanner.nextInt();  // ค่าตัวเลขเริ่มต้นที่ผู้ใช้ป้อนจะถูกเก็บไว้ในตัวแปร numStart ที่มีประเภทเป็น int

            System.out.print("ตัวเลขสูงสุด: ");  // โปรแกรมจะแสดงข้อความ "ตัวเลขสูงสุด: " เพื่อให้ผู้ใช้ป้อนค่าตัวเลขสูงสุด
            int numMax = scanner.nextInt();  // ค่าตัวเลขสูงสุดที่ผู้ใช้ป้อนจะถูกเก็บไว้ในตัวแปร numMax ที่มีประเภทเป็น int

            int n, sum = 0;  // โปรแกรมจะสร้างตัวแปร n เพื่อเก็บค่าตัวเลขที่สุ่มได้ในแต่ละรอบของลูป, โปรแกรมจะสร้างตัวแปร sum เพื่อเก็บผลรวมของตัวเลขที่สุ่มได้

            for (int i = numStart; i <= numMax; i++) {  // โปรแกรมจะทำงานในลูป for ตามค่าเริ่มต้นและค่าสูงสุดที่ผู้ใช้ป้อน ในแต่ละรอบของลูป โปรแกรมจะสุ่มตัวเลขในช่วง 0-99 และเพิ่มค่าของตัวเลขสุ่มได้เข้าสู่ตัวแปร sum
                n = (int)(Math.random() * 100);
                sum += n;
                System.out.printf("จำนวนที่ %d คือ %d\n", i, n);  // ในแต่ละรอบของลูป for โปรแกรมจะแสดงผลลัพธ์ด้วยข้อความ "จำนวนที่ x คือ y" เมื่อ x คือค่าของตัวแปร i และ y คือค่าของตัวแปร n ที่สุ่มได้
            }
            System.out.println("รวมทั้งหมด: " + sum);  // เมื่อลูป for ทำงานเสร็จสิ้น โปรแกรมจะแสดงผลลัพธ์รวมของตัวเลขทั้งหมดด้วยข้อความ "รวมทั้งหมด: z" เมื่อ z คือค่าของตัวแปร sum
            scanner.close();
        }
    }
}

/* 
ตัวเลขเริ่มต้น: 5
ตัวเลขสูงสุด: 45
จำนวนที่ 5 คือ 6
จำนวนที่ 6 คือ 62
จำนวนที่ 7 คือ 72
จำนวนที่ 8 คือ 64
จำนวนที่ 9 คือ 99
จำนวนที่ 10 คือ 45
จำนวนที่ 11 คือ 30
จำนวนที่ 12 คือ 11
จำนวนที่ 13 คือ 28
จำนวนที่ 14 คือ 78
จำนวนที่ 15 คือ 63
จำนวนที่ 16 คือ 2
จำนวนที่ 17 คือ 96
จำนวนที่ 18 คือ 19
จำนวนที่ 19 คือ 78
จำนวนที่ 20 คือ 58
จำนวนที่ 21 คือ 9
จำนวนที่ 22 คือ 57
จำนวนที่ 23 คือ 71
จำนวนที่ 24 คือ 55
จำนวนที่ 25 คือ 25
จำนวนที่ 26 คือ 87
จำนวนที่ 27 คือ 76
จำนวนที่ 28 คือ 75
จำนวนที่ 29 คือ 68
จำนวนที่ 30 คือ 88
จำนวนที่ 31 คือ 72
จำนวนที่ 32 คือ 85
จำนวนที่ 33 คือ 32
จำนวนที่ 34 คือ 43
จำนวนที่ 35 คือ 69
จำนวนที่ 36 คือ 40
จำนวนที่ 37 คือ 86
จำนวนที่ 38 คือ 45
จำนวนที่ 39 คือ 8
จำนวนที่ 40 คือ 0
จำนวนที่ 41 คือ 65
จำนวนที่ 42 คือ 63
จำนวนที่ 43 คือ 19
จำนวนที่ 44 คือ 27
จำนวนที่ 45 คือ 43
รวมทั้งหมด: 2119
 */