package For;
class B2_for {
    public static void main(String[] args) {
        int sum = 0;  // โปรแกรมจะสร้างตัวแปร sum และกำหนดค่าเริ่มต้นเป็น 0
        for (int i = 0; i <= 10; i++) {
            // โปรแกรมจะเริ่มทำงานในลูป for โดยตัวแปร i มีค่าเริ่มต้นเป็น 0
            // ในแต่ละรอบของลูป for โปรแกรมจะเพิ่มค่าของตัวแปร i เข้าไปในตัวแปร sum ซึ่งเป็นการสะสมผลรวมของตัวเลข
            // เมื่อค่าของตัวแปร i เกินค่าสูงสุดที่กำหนด (10) ลูป for จะสิ้นสุดการทำงาน
            sum += i;  
        }
        System.out.println(sum); // โปรแกรมจะแสดงผลลัพธ์ของผลรวมที่คำนวณได้ด้วยคำสั่ง System.out.println(sum)
    }
} 

// ดังนั้น ผลลัพธ์ที่แสดงบนหน้าจอคือผลรวมของตัวเลขตั้งแต่ 0 ถึง 10