package For;
public class B3_for {
    public static void main(String[] args) {
        int sum = 0;  // โปรแกรมจะสร้างตัวแปร sum และกำหนดค่าเริ่มต้นเป็น 0
        for (int a = 0; a <= 50; a += 5) {
            /*
            โปรแกรมจะทำงานในลูป for โดยตัวแปร a มีค่าเริ่มต้นเป็น 0
            ในแต่ละรอบของลูป for โปรแกรมจะกำหนดค่าของตัวแปร sum เป็นค่าของตัวแปร a ในแต่ละรอบของลูป
            โปรแกรมจะเพิ่มค่าของตัวแปร a ทีละ 5 ในแต่ละรอบของลูป
             */
            sum = a;  // เมื่อค่าของตัวแปร a เกินค่าสูงสุดที่กำหนด (50) ลูป for จะสิ้นสุดการทำงาน
        }
        System.out.print(sum);  // โปรแกรมจะแสดงผลลัพธ์ของตัวแปร sum ด้วยคำสั่ง System.out.print(sum)
    }
}

/* 
ผลลัพธ์ของตัวเลขในลูป for ที่เพิ่มขึ้นทีละ 5 จาก 0 ถึง 50
ดังนั้น ผลลัพธ์ที่แสดงบนหน้าจอคือค่าสุดท้ายของตัวแปร a ในลูป ซึ่งเป็นตัวเลขที่นับไปล่าสุดก่อนที่ค่าของ a จะเกิน 50 ในที่นี้คือ 50
*/ 