package For;
public class B5_for {
    public static void main(String[] args) {
        double sum = 0;  // โปรแกรมจะสร้างตัวแปร sum และกำหนดค่าเริ่มต้นเป็น 0
        for (double x = 1.5; x <= 7.5; x += 0.5) {
            /*
            โปรแกรมจะทำงานในลูป for โดยตัวแปร x มีค่าเริ่มต้นเป็น 1.5
            ในแต่ละรอบของลูป for โปรแกรมจะกำหนดค่าของตัวแปร sum เป็นค่าของตัวแปร x ที่แปลงเป็นทศนิยมด้วยการหารด้วย 10.0 ในแต่ละรอบของลูป
            โปรแกรมจะเพิ่มค่าของตัวแปร x ทีละ 0.5 ในแต่ละรอบของลูป
             */
            sum = x / 10.0; // เมื่อค่าของตัวแปร x เกินค่าสูงสุดที่กำหนด (7.5) ลูป for จะสิ้นสุดการทำงาน
        }
        System.out.print(sum);  // โปรแกรมจะแสดงผลลัพธ์ของตัวแปร sum ด้วยคำสั่ง System.out.print(sum)
    }
}

/*
แสดงผลลัพธ์ของตัวเลขในลูป for โดยเริ่มต้นที่ 1.5 และเพิ่มขึ้นทีละ 0.5 จนถึง 7.5
ดังนั้น ผลลัพธ์ที่แสดงบนหน้าจอคือค่าสุดท้ายของตัวแปร sum ในลูป ซึ่งเป็นผลหารของค่า x ในรูปแบบทศนิยม โดยใช้ค่า x ในรอบสุดท้ายของลูป (7.5) และนำผลลัพธ์มาแสดงผล
 */