package If_else;
import java.util.*;
/*
คำสั่ง import java.util.*; ใช้ในการนำเข้าแพ็คเกจ (package) java.util ทั้งหมดเข้าสู่โปรแกรม Java ที่กำลังเขียน โดยแพ็คเกจ java.util เป็นแพ็คเกจที่มีคลาสและอ็อบเจ็กต์ที่เกี่ยวข้องกับการทำงานทั่วไป เช่น การอ่านข้อมูลจากคีย์บอร์ด (Scanner) และการจัดการกับโคลเล็กชัน (Collection) เป็นต้น

การใช้ import java.util.*; จะทำให้เราสามารถเรียกใช้คลาสและอ็อบเจ็กต์ในแพ็คเกจ java.util โดยไม่ต้องระบุชื่อแพ็คเกจที่แนบมาแต่ละครั้ง ตัวอย่างเช่น Scanner scanner = new Scanner(System.in); เราไม่จำเป็นต้องระบุ java.util.Scanner เพราะ Scanner ถูกนำเข้าอยู่ในแพ็คเกจ java.util ซึ่งถูกนำเข้าไว้ที่แถวแรกของโปรแกรมด้วย import java.util.*;

การใช้ import java.util.*; มีความสะดวกในการเขียนโปรแกรมเนื่องจากไม่ต้องระบุแพ็คเกจที่ใช้ทุกครั้ง แต่ในบางกรณีที่โปรแกรมมีการนำเข้าแพ็คเกจอื่นๆ ที่มีชื่อคล้ายกัน เช่น java.sql.*; และ javax.swing.*; อาจทำให้เกิดความขัดแย้งชื่อคลาสได้ ดังนั้นในบางครั้งควรระบุชื่อแพ็คเกจอย่างชัดเจนเพื่อหลีกเลี่ยงความขัดแย้งชื่อคลาส
 */

class A2_if {
    public static void main(String[] args) {
        /*
         คำสั่ง try (Scanner scanner = new Scanner(System.in)) เป็นการใช้งานการจัดการทรัพยากรแบบอัตโนมัติ (automatic resource management) โดยใช้ Scanner เป็นตัวอย่าง โดยใช้ในการอ่านข้อมูลจากคีย์บอร์ด (System.in) ในบล็อก try และจะทำการปิดแหล่งข้อมูลอัตโนมัติหลังจากใช้งานเสร็จสิ้น โดยไม่ต้องเรียกเมธอด close() แยกต่างหาก
         */

        try (Scanner scanner = new Scanner (System.in)) {  
            /*
            เราใช้ try เพื่อเริ่มต้นบล็อก try สำหรับการจัดการทรัพยากรแบบอัตโนมัติ 
            ในวงเล็บหลังคำสั่ง try เราสร้างอ็อบเจ็กต์ Scanner และกำหนดให้เก็บในตัวแปร scanner ซึ่งจะใช้ในการอ่านข้อมูลจากคีย์บอร์ด
            */
            System.out.print("ป้อนจำนวนเพื่อตรวจสอบ: ");
            int number = scanner.nextInt();  // เราทำงานภายในบล็อก try โดยอ่านจำนวนที่ผู้ใช้ป้อนเข้ามาและเก็บค่าในตัวแปร number

            if (number % 2 == 0) {  // เราใช้เงื่อนไข (number % 2 == 0) เพื่อตรวจสอบว่า number เป็นเลขคู่หรือไม่ และแสดงผลลัพธ์
                System.out.print(number + " เป็นเลขคู่");
            } else {
                System.out.print(number + " เป็นเลขคี่");
            }
            scanner.close(); // เมื่อบล็อก try สิ้นสุดลง ระบบจะทำการปิดแหล่งข้อมูล Scanner อัตโนมัติด้วยเมธอด close()
        }

    }
}