package If_else;
import java.util.*;  // นำเข้าแพ็คเกจ java.util ที่ใช้ในการอ่านข้อมูลจากคีย์บอร์ด ด้วยคำสั่ง import java.util.*;

public class A5_if {
    public static void main(String[] args){
        try (Scanner scanner = new Scanner(System.in)) {
            /*
            เริ่มต้นบล็อก try สำหรับการจัดการทรัพยากรแบบอัตโนมัติ
            สร้างอ็อบเจ็กต์ Scanner และเก็บไว้ในตัวแปร scanner เพื่อใช้ในการอ่านข้อมูลจากคีย์บอร์ด
             */
            System.out.print("จำนวนเงินที่ต้องการถอน: "); // แสดงข้อความ "จำนวนเงินที่ต้องการถอน: " เพื่อแจ้งให้ผู้ใช้ป้อนจำนวนเงินที่ต้องการถอน
            double withdraw = scanner.nextDouble(); // อ่านค่าที่ผู้ใช้ป้อนเข้ามาในตัวแปร withdraw ด้วยเมธอด nextDouble() ของอ็อบเจ็กต์ scanner
            
            double balance = 50000; // สร้างตัวแปร balance และกำหนดค่าเริ่มต้นเป็น 50000 (ยอดเงินคงเหลือในบัญชี)

            if (balance < withdraw) { // เริ่มต้นตรวจสอบเงื่อนไขว่า balance น้อยกว่า withdraw ด้วยเงื่อนไข balance < withdraw
                System.out.print("ยอดเงินคงเหลือไม่เพียงพอ"); // ถ้าเงื่อนไขเป็นจริง (ยอดเงินคงเหลือไม่เพียงพอสำหรับการถอน) แสดงผลลัพธ์ว่า "ยอดเงินคงเหลือไม่เพียงพอ"
            } else if (withdraw > 20000) { // ถ้าเงื่อนไขเป็นเท็จ ให้เข้าสู่เงื่อนไขถัดไป ที่เป็นเงื่อนไข withdraw > 20000 และตรวจสอบว่าจำนวนเงินที่ถอนมีค่ามากกว่า 20000 บาทหรือไม่
                System.out.print("ถอนได้ไม่เกิน 20000 บาท/วัน"); // ถ้าเงื่อนไขเป็นจริง (จำนวนเงินที่ถอนมากกว่า 20000 บาท) แสดงผลลัพธ์ว่า "ถอนได้ไม่เกิน 20000 บาท/วัน"
            } else if (withdraw % 100 != 0) { //ถ้าเงื่อนไขเป็นเท็จ ให้เข้าสู่เงื่อนไขถัดไป ที่เป็นเงื่อนไข withdraw % 100 != 0 และตรวจสอบว่าจำนวนเงินที่ถอนไม่เป็นจำนวนเต็มร้อยหรือไม่
                System.out.print("ต้องเป็นจำนวนเต็มร้อยเท่านั้น"); // ถ้าเงื่อนไขเป็นจริง (จำนวนเงินที่ถอนไม่เป็นจำนวนเต็มร้อย) แสดงผลลัพธ์ว่า "ต้องเป็นจำนวนเต็มร้อยเท่านั้น"
            } else {
                balance -= withdraw; // ถ้าทั้งสองเงื่อนไขในข้อที่ 10 และ 12 เป็นเท็จ ให้ทำการถอนเงินจากยอดเงินคงเหลือ balance โดยลดค่า withdraw ออกจาก balance
            }
            scanner.close(); // ปิดอ็อบเจ็กต์ scanner ด้วยเมธอด close()
        }
    }
}

/*
โค้ดนี้ใช้งานการจัดการทรัพยากรแบบอัตโนมัติเพื่อรับค่าจากผู้ใช้และตรวจสอบเงื่อนไขก่อนที่จะทำการถอนเงิน โดยหากยอดเงินคงเหลือไม่เพียงพอสำหรับการถอน โปรแกรมจะแสดงผลลัพธ์ว่า "ยอดเงินคงเหลือไม่เพียงพอ" และโดยเพิ่มเงื่อนไขเพื่อตรวจสอบว่าจำนวนเงินที่ถอนไม่เป็นจำนวนเต็มร้อยหรือไม่ ถ้าเงื่อนไขเป็นจริง โปรแกรมจะแสดงผลลัพธ์ว่า "ต้องเป็นจำนวนเต็มร้อยเท่านั้น" และถ้าทั้งสองเงื่อนไขเป็นเท็จ โปรแกรมจะทำการถอนเงินจากยอดเงินคงเหลือ และไม่แสดงผลลัพธ์ใดๆ
 */
