package If_else;
import java.util.*;

public class A6_if {
    public static void main(String[] args) {
        try (Scanner scanner = new Scanner(System.in)) {  // โปรแกรมจะใช้คลาส Scanner เพื่ออ่านค่าที่ผู้ใช้ป้อนผ่านคีย์บอร์ด
            System.out.print("กรอกคะแนนนักเรียน: ");  // โปรแกรมจะแสดงข้อความ "กรอกคะแนนนักเรียน: " เพื่อให้ผู้ใช้ป้อนคะแนนนักเรียนที่ต้องการตรวจสอบ
            
            int score = scanner.nextInt();  // คะแนนที่ผู้ใช้ป้อนจะถูกเก็บไว้ในตัวแปร score ที่มีประเภทเป็น int
            char grade;
           
            // โปรแกรมจะตรวจสอบคะแนนที่ผู้ใช้ป้อนและกำหนดเกรดตามเงื่อนไขต่อไปนี้:
            if (score >= 90) {  // ถ้าคะแนน (score) มากกว่าหรือเท่ากับ 90 จะกำหนดเกรด A
                grade = 'A';
            } else if (score >= 80) {  // ถ้าคะแนน (score) มากกว่าหรือเท่ากับ 80 แต่น้อยกว่า 90 จะกำหนดเกรด B
                grade = 'B';
            }else if (score >= 70) {  // ถ้าคะแนน (score) มากกว่าหรือเท่ากับ 70 แต่น้อยกว่า 80 จะกำหนดเกรด C
                grade = 'C';
            } else if (score >=60) {  // ถ้าคะแนน (score) มากกว่าหรือเท่ากับ 60 แต่น้อยกว่า 70 จะกำหนดเกรด D
                grade = 'D';
            } else {
                grade = 'F';  // ถ้าคะแนน (score) น้อยกว่า 60 จะกำหนดเกรด F
            }
            // เกรดที่ได้จะถูกเก็บไว้ในตัวแปร grade ที่มีประเภทเป็น char
            System.out.println(grade);  // โปรแกรมจะแสดงผลลัพธ์เกรดที่ได้ในหน้าจอ
            scanner.close();  // โปรแกรมจะปิดการทำงานของ Scanner ที่ถูกสร้างขึ้นในบรรทัดเริ่มต้น
        }
    }
}


// สรุปคือโปรแกรมนี้รับคะแนนนักเรียนจากผู้ใช้และกำหนดเกรดตามเกณฑ์ที่กำหนด จากนั้นแสดงผลเกรดที่ได้ในหน้าจอ
