package While;
import java.util.*;
public class C2_while {
    public static void main(String[] args){
        Scanner scanner = new Scanner(System.in);  // โปรแกรมจะสร้างอ็อบเจ็กต์ของคลาส Scanner เพื่ออ่านข้อมูลจากคีย์บอร์ด
        boolean validCode = false;  // โปรแกรมจะสร้างตัวแปร validCode และกำหนดค่าเริ่มต้นเป็น false เพื่อระบุว่ารหัสผ่านไม่ถูกต้อง
        String code = "";  // โปรแกรมจะสร้างตัวแปร code เพื่อเก็บค่ารหัสผ่านที่ผู้ใช้ป้อนเข้ามา
        while (validCode == false){  // โปรแกรมจะทำงานในลูป while จนกว่า validCode จะเป็น true (ค่ารหัสผ่านถูกต้อง)
            System.out.print("กรุณาใส่รหัสผ่าน >> ");  // ภายในลูป while โปรแกรมจะแสดงข้อความ "กรุณาใส่รหัสผ่าน >> " เพื่อขอรหัสผ่านจากผู้ใช้ และรับค่าที่ผู้ใช้ป้อนเข้ามาผ่านตัวแปร code
            code = scanner.next();
            if (code.equals("1234")) {  // โปรแกรมจะใช้เงื่อนไข if เพื่อเปรียบเทียบค่าของตัวแปร code กับรหัสผ่านที่ถูกต้อง (ในที่นี้เป็น "1234")
                validCode = true;  // ถ้ารหัสผ่านถูกต้อง โปรแกรมจะกำหนดค่า validCode เป็น true เพื่อให้ลูป while สิ้นสุดการทำงาน
            }
        } 
        System.out.println("คุณใส่รหัสถูกต้อง");  // เมื่อลูป while สิ้นสุดการทำงาน โปรแกรมจะแสดงข้อความ "คุณใส่รหัสถูกต้อง"
        scanner.close();  // โปรแกรมจะปิดอ็อบเจ็กต์ Scanner เพื่อส่งสัญญาณปิดการอ่านข้อมูลจากคีย์บอร์ด
    }
}

/*
ใช้สำหรับตรวจสอบความถูกต้องของรหัสผ่านที่ผู้ใช้ป้อนเข้ามา
ดังนั้น โปรแกรมจะทำงานในลูป while และตรวจสอบรหัสผ่านที่ผู้ใช้ป้อนเข้ามา จนกว่ารหัสผ่านจะถูกต้อง แล้วจึงแสดงข้อความว่า "คุณใส่รหัสถูกต้อง"
 */