package While;
import java.util.*;
public class C3_doWhile {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);  // โปรแกรมจะสร้างอ็อบเจ็กต์ของคลาส Scanner เพื่ออ่านข้อมูลจากคีย์บอร์ด
        System.out.print("กรุณาใส่ตัวเลข >> ");  // โปรแกรมจะแสดงข้อความ "กรุณาใส่ตัวเลข >> "
        int n = scanner.nextInt();  // เพื่อขอตัวเลขจากผู้ใช้ และรับค่าที่ผู้ใช้ป้อนเข้ามาผ่านตัวแปร n
        int d, remain = n;  // โปรแกรมจะสร้างตัวแปร d เพื่อเก็บค่าหลักที่เหลือของตัวเลขที่ผู้ใช้ป้อนเข้ามา
        String str = "";

        do {
            d = remain % 10;  // โปรแกรมจะสร้างตัวแปร remain เพื่อเก็บค่าที่เหลือของตัวเลขที่ผู้ใช้ป้อนเข้ามา
            str += d + "\n";  // โปรแกรมจะสร้างตัวแปร str เพื่อเก็บข้อความที่เป็นแยกหลักของตัวเลข
            remain = (int) (remain / 10); // โปรแกรมจะทำงานในลูป do-while ตราบใดที่ค่าของตัวแปร remain ไม่เท่ากับ 0
        } while (remain != 0);  
        /* 
        ในแต่ละรอบของลูป do-while โปรแกรมจะคำนวณหลักสุดท้ายของตัวเลขที่เหลืออยู่และเก็บค่าไว้ในตัวแปร d
        โปรแกรมจะเพิ่มค่าของตัวแปร d เข้าไปในตัวแปร str เพื่อสร้างข้อความที่แยกหลักของตัวเลข
        โปรแกรมจะปรับค่าของตัวแปร remain ให้เป็นผลหารของ remain กับ 10 เพื่อลบหลักสุดท้ายออกไป
        เมื่อค่าของตัวแปร remain เท่ากับ 0 ลูป do-while จะสิ้นสุดการทำงาน
        */ 
        System.out.println("ตัวเลขที่แยกได้คือ\n" +str);  // โปรแกรมจะแสดงผลลัพธ์ด้วยคำสั่ง System.out.println() โดยแสดงข้อความ "ตัวเลขที่แยกได้คือ" และค่าของตัวแปร str ที่เก็บข้อความที่แยกหลักของตัวเลข
        scanner.close();  // โปรแกรมจะปิดอ็อบเจ็กต์ Scanner เพื่อส่งสัญญาณปิดการอ่านข้อมูลจากคีย์บอร์ด
    }
}

// ดังนั้น โปรแกรมจะรับตัวเลขจากผู้ใช้และแยกหลักของตัวเลขนั้น แล้วแสดงผลลัพธ์ที่แยกหลักได้ในรูปแบบข้อความ
